import React from 'react'
import s from './Header.module.css'

const Header = () => {

    return (
        <header>
            <div className={s.whiteBackgroud}>
                <div className={s.container}>
                    <div className={s.Header__topInfo}>
                        <div>
                            <svg width="17" height="24" viewBox="0 0 17 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M8.79648 0.738281C4.48407 0.738281 0.975586 4.24676 0.975586 8.55917C0.975586 13.9794 8.80417 23.2383 8.80417 23.2383C8.80417 23.2383 16.6174 13.7129 16.6174 8.55917C16.6174 4.24676 13.109 0.738281 8.79648 0.738281ZM11.1562 10.8491C10.5055 11.4997 9.65108 11.825 8.79648 11.825C7.94202 11.825 7.08728 11.4997 6.43689 10.8491C5.1357 9.54808 5.1357 7.43101 6.43689 6.12982C7.06696 5.49948 7.90507 5.15231 8.79648 5.15231C9.68788 5.15231 10.5259 5.49962 11.1562 6.12982C12.4574 7.43101 12.4574 9.54808 11.1562 10.8491Z" fill="#FF8514" />
                            </svg>
                            <div className={s.Header__topInfo_location}>Хмельницкий</div>
                        </div>
                        <div className={s.Header__topInfo_workTime}>График работы: 09:00-21:00</div>
                        <div className={s.Header__topInfo_PhoneNumber}>
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M18.3952 13.1277C17.1707 13.1277 15.9684 12.9362 14.8291 12.5597C14.2708 12.3693 13.5845 12.544 13.2438 12.8939L10.995 14.5915C8.38703 13.1994 6.78057 11.5934 5.40745 9.00505L7.0551 6.81484C7.48318 6.38734 7.63672 5.76286 7.45276 5.17693C7.07464 4.03161 6.88255 2.8299 6.88255 1.6049C6.8826 0.719948 6.16266 0 5.27776 0H1.60484C0.719948 0 0 0.719948 0 1.60484C0 11.7481 8.25198 20 18.3952 20C19.2801 20 20.0001 19.2801 20.0001 18.3952V14.7325C20 13.8477 19.2801 13.1277 18.3952 13.1277Z" fill="#FF8514" />
                            </svg>
                                +380964773085
                            </div>
                    </div>
                </div>
            </div>
        </header>
    )
}

export default Header